faweiz/FACEBOOKapo/nRF5_SDK_12.1/examples/ble_peripheral/3DPS_UART_SPI16_ADS_Shift_Register/main.c
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
 *
 * @defgroup ble_sdk_uart_over_ble_main main.c
 * @{
 * @ingroup  ble_sdk_app_nus_eval
 * @brief    UART over BLE application main file.
 *
 * This file contains the source code for a sample application that uses the Nordic UART service.
 * This application uses the @ref srvlib_conn_params module.
 */

#include <stdio.h>
#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "softdevice_handler.h"
#include "app_timer.h"
#include "app_button.h"
#include "ble_nus.h"
#include "app_uart.h"
#include "app_util_platform.h"
#include "bsp.h"
#include "bsp_btn_ble.h"

//*********************** Modified on 12/20/2016 ***********************//
#include "nrf_delay.h"

//*********************** Modified on 1/15/2017 (Add SPI) ***********************//
#include "nrf_drv_spi.h"
#include "app_util_platform.h"
#include "nrf_gpio.h"
#include "nrf_delay.h"
#include "boards.h"
#include "app_error.h"
#include <string.h>
#define NRF_LOG_MODULE_NAME "APP"
#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "sdk_config_spi.h"
#include "math.h"

#define numCols 16
#define numRows 10
int TotalSensors = numCols * numRows;

// ADS7953 Multiplexer ADC
#define SPI__ADS_INSTANCE  0 /**< SPI instance index. */
static const nrf_drv_spi_t spi_ads = NRF_DRV_SPI_INSTANCE(SPI__ADS_INSTANCE);  /**< SPI instance. */

// 74HC595 Shift Register
#define SPI_Shift_INSTANCE  1 /**< SPI instance index. */
static const nrf_drv_spi_t spi_shift = NRF_DRV_SPI_INSTANCE(SPI_Shift_INSTANCE);  /**< SPI instance. */
static volatile bool spi_xfer_done;  /**< Flag used to indicate that SPI instance completed the transfer. */

// UART Variables	
		uint16_t length;
		uint8_t PrintBuffer[3];
		uint32_t send_value = 0;		
		double send_incomingValues;
		int incomingValues[160] = {0};
// Shift Register Variables
		static uint8_t       m_tx_buf_shift[1];
		static const uint8_t m_length_shift = sizeof(m_tx_buf_shift);        /**< Transfer length. */	
		static uint8_t       m_tx_buf_shift16[16][1] = {0x01,0x02,0x04,0x08,0x10,0x20,0x40,0x80,0x80,0x40,0x20,0x10,0x08,0x04,0x02,0x01};	/**< Shift Register TX buffer. */

			static uint8_t       m_tx_buf_sh[]={0xff};
			static const uint8_t m_length_sh = sizeof(m_tx_buf_shift);        /**< Transfer length. */	

			
// SPI Variables		
		uint16_t spi_rx;
		int ADC_value;
		double voltage_value;
// ADS7953 Variables		
		//static uint8_t       m_tx_buf[]={0x18,0x00};
		static uint8_t       m_tx_buf_ads[2];
		static uint8_t       m_rx_buf_ads[sizeof(m_tx_buf_ads) + 1];    /**< RX buffer. */
		static const uint8_t m_length_ads = sizeof(m_tx_buf_ads);        /**< Transfer length. */																						
			static uint8_t       m_tx_buf_ads16[12][2] = { {0x18,0x00},
																									{0x10,0x80},
																									{0x11,0x00},
																									{0x11,0x80},
																									{0x12,0x00},
																									{0x12,0x80},
																									{0x13,0x00},
																									{0x13,0x80},
																									{0x14,0x00},
																									{0x14,0x80},
																									{0x00,0x00},
																									{0x00,0x00}																						
																								};	


//static uint8_t       m_tx_buf_ads16[18][2] = { {0x18,0x00},
//																									{0x10,0x80},
//																									{0x11,0x00},
//																									{0x11,0x80},
//																									{0x12,0x00},
//																									{0x12,0x80},
//																									{0x13,0x00},
//																									{0x13,0x80},
//																									{0x14,0x00},
//																									{0x14,0x80},
//																									{0x15,0x00},
//																									{0x15,0x80},
//																									{0x16,0x00},
//																									{0x16,0x80},
//																									{0x17,0x00},
//																									{0x17,0x80},
//																									{0x00,0x00},
//																									{0x00,0x00}																						
//																								};
/*
static uint8_t       m_tx_buf_ads16[18][2] = { {0x18,0x00},
																							{0x18,0x80},
																							{0x19,0x00},
																							{0x19,0x80},
																							{0x1A,0x00},
																							{0x1A,0x80},
																							{0x1B,0x00},
																							{0x1B,0x80},
																							{0x1C,0x00},
																							{0x1C,0x80},
																							{0x1D,0x00},
																							{0x1D,0x80},
																							{0x1E,0x00},
																							{0x1E,0x80},
																							{0x1F,0x00},
																							{0x1F,0x80},
																							{0x00,0x00},
																							{0x00,0x00}																							
																						};
*/
#define IS_SRVC_CHANGED_CHARACT_PRESENT 0                                           /**< Include the service_changed characteristic. If not enabled, the server's database cannot be changed for the lifetime of the device. */

#if (NRF_SD_BLE_API_VERSION == 3)
#define NRF_BLE_MAX_MTU_SIZE            GATT_MTU_SIZE_DEFAULT                       /**< MTU size used in the softdevice enabling and to reply to a BLE_GATTS_EVT_EXCHANGE_MTU_REQUEST event. */
#endif

#define APP_FEATURE_NOT_SUPPORTED       BLE_GATT_STATUS_ATTERR_APP_BEGIN + 2        /**< Reply when unsupported features are requested. */

#define CENTRAL_LINK_COUNT              0                                           /**< Number of central links used by the application. When changing this number remember to adjust the RAM settings*/
#define PERIPHERAL_LINK_COUNT           1                                           /**< Number of peripheral links used by the application. When changing this number remember to adjust the RAM settings*/

#define DEVICE_NAME                     "3DPS_VCU"                               /**< Name of device. Will be included in the advertising data. */
#define NUS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_ADV_INTERVAL                64                                          /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */
#define APP_ADV_TIMEOUT_IN_SECONDS      180                                         /**< The advertising timeout (in units of seconds). */

#define APP_TIMER_PRESCALER             0                                           /**< Value of the RTC1 PRESCALER register. */
#define APP_TIMER_OP_QUEUE_SIZE         4                                           /**< Size of timer operation queues. */

