faweiz/FACEBOOKapo/nRF5_SDK_12.1/examples/ble_peripheral/3DPS_UART_SPI16_ADS_Shift_Register/main.c
    APP_ERROR_CHECK(NRF_LOG_INIT(NULL));

    NRF_LOG_INFO("SPI Shift Register example\r\n");

    nrf_drv_spi_config_t spi_config_shift = NRF_DRV_SPI_DEFAULT_CONFIG;
    spi_config_shift.ss_pin   = NRF_DRV_SPI_PIN_NOT_USED;
    spi_config_shift.miso_pin = NRF_DRV_SPI_PIN_NOT_USED;
    spi_config_shift.mosi_pin = SPI_SHIFT_MOSI_DS_PIN;
    spi_config_shift.sck_pin  = SPI_SHIFT_SHCP_SCK_PIN;
		spi_config_shift.frequency  = NRF_DRV_SPI_FREQ_125K;
    APP_ERROR_CHECK(nrf_drv_spi_init(&spi_shift, &spi_config_shift, spi_shift_event_handler));
}
void SPI_shift_Function(uint8_t tx_buf_shift[]){
//void SPI_shift_Function(){
        spi_xfer_done = false;

//				APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi_shift, m_tx_buf_sh, m_length_sh, NULL, 0));
				APP_ERROR_CHECK(nrf_drv_spi_transfer(&spi_shift, tx_buf_shift, m_length_shift, NULL, 0));

        while (!spi_xfer_done)
        {
            __WFE();
        }

        NRF_LOG_FLUSH();
        LEDS_INVERT(BSP_LED_0_MASK);
        nrf_delay_ms(20); //delay 20 msec
}

/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;
    bool erase_bonds;
	
    // Initialize.
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
    uart_init();

    buttons_leds_init(&erase_bonds);
    ble_stack_init();
    gap_params_init();
    services_init();
    advertising_init();
    conn_params_init();
		
    printf("\r\nUART Start!\r\n");
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

// ADS7953
		SPI_ADS_init();
// Shift Register	
		SPI_shift_init();
		 
    // Enter main loop.
		while(1)
    {
//				for(int col=0;col<16;col++)
//				{
//					for(int i=0; i<1;i++)
//					{
//						m_tx_buf_shift[i] = m_tx_buf_shift16[col][i];
//	// Debug				
//	//					printf("m_tx_buf_shift[%d] = %d \n",col,m_tx_buf_shift[i]);					
//					}
//	//// Call Shift Register SPI				
//					SPI_shift_Function(m_tx_buf_shift);
//				}
			
//			SPI_shift_Function();
				
				
			
//****************** Modified on 12/20/2016 （UART + SPI_ADC) ******************//
			//Column: 74HC595
			for(int col=0;col<16;col++)
			{
				for(int i=0; i<1;i++)
				{
					m_tx_buf_shift[i] = m_tx_buf_shift16[col][i];
// Debug				
//					printf("m_tx_buf_shift[%d] = %d \n",col,m_tx_buf_shift[i]);					
				}
//// Call Shift Register SPI				
				SPI_shift_Function(m_tx_buf_shift);
				
//				SPI_shift_Function();
				
				
						// Row: ADS7953
						for(int row=0;row<12;row++)
						{
							for(int j=0; j<2;j++)
							{
								m_tx_buf_ads[j] = m_tx_buf_ads16[row][j];
							}
// Call ADS7953 SPI
							SPI_ADS_Function(m_tx_buf_ads);
							if(row>=2)
							{
							spi_rx = ((m_rx_buf_ads[0]&0x0F)<<8) | m_rx_buf_ads[1];
							ADC_value = spi_rx;
							// Reset rx buffer
							if(ADC_value != 0 & ADC_value <= 500)
									ADC_value=0;
							voltage_value = ADC_value / (4095/2.5);	
// Debug (If use required to increasing nrf_delay_ms!!!)
		//						printf("\n Channel %d \n",i-2);
		//						printf(" ADC Value = %d \n",ADC_value);
		//						printf(" Voltage = %.3f \n",voltage_value);
		//						printf(" spi_rx = %x \n",spi_rx);
		//						printf(" m_rx_buf_ads[0] = %d \n",m_rx_buf_ads[0]);
		//						printf(" m_rx_buf_ads[1] = %d \n",m_rx_buf_ads[1]);
							incomingValues[col*numRows + (row-2)] = ADC_value;						
// Debug							
//						printf("incomingValue[%d] = %d ",col*numRows + (row-2),ADC_value);					
//						incomingValues[(row-2)] = ADC_value;
							}
						} // END "Row" loop
				}	// END "Coulumn" loop
				for(int k=0; k<TotalSensors;k++)
				{
						if(send_value == k){
						send_incomingValues = incomingValues[k] / (4095/2.5);
// Clear PrintBuffer buffer	
						memset(PrintBuffer,0x00,sizeof(PrintBuffer));
						sprintf((char*) PrintBuffer, "%.3f", send_incomingValues);
// Get data length
						length = strlen((char*)PrintBuffer);	
// Sent data over BLE		
						ble_nus_string_send(&m_nus, PrintBuffer, length);
					}
					printf("%d",incomingValues[k]);
// Debug (If use required to increasing nrf_delay_ms!!!)
//					printf(" k[%d] : %d ", k,incomingValues[k]);
				if(k<TotalSensors-1) printf(",");
					nrf_delay_ms(5); //delay 5 msec
			}
			 printf("\n");		
		 power_manage();		


    }
}
